<html><head>
      <meta http-equiv="Content-Type" content="text/html; charset=ISO-8859-1">
   <title>&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1054; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</title><link rel="stylesheet" type="text/css" href="css/manual-multipage.css"><meta name="generator" content="DocBook XSL Stylesheets V1.78.1"><link rel="home" href="index.html" title="Git as Subversion"><link rel="up" href="index.html" title="Git as Subversion"><link rel="prev" href="index.html" title="Git as Subversion"><link rel="next" href="ch02.html" title="&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;"></head><body bgcolor="white" text="black" link="#0000FF" vlink="#840084" alink="#0000FF"><div class="navheader"><table width="100%" summary="Navigation header"><tr><th colspan="3" align="center">&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1054; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</th></tr><tr><td width="20%" align="left"><a accesskey="p" href="index.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><th width="60%" align="center">&nbsp;</th><td width="20%" align="right">&nbsp;<a accesskey="n" href="ch02.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr></table><hr></div><div class="chapter"><div class="titlepage"><div><div><h1 class="title"><a name="d5e15"></a>&#1043;&#1083;&#1072;&#1074;&#1072; 1. &#1054; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1077;</h1></div></div></div>
  

  <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e17"></a>&#1063;&#1090;&#1086; &#1101;&#1090;&#1086;?</h2></div></div></div>
    

    <p><span class="productname">Git as Subversion</span> (<a class="ulink" href="https://github.com/bozaro/git-as-svn" target="_top">https://github.com/bozaro/git-as-svn</a>)
    &#8212; &#1101;&#1090;&#1086; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; Subversion-&#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1072; (&#1087;&#1086; &#1087;&#1088;&#1086;&#1090;&#1086;&#1082;&#1086;&#1083;&#1091; svn) &#1076;&#1083;&#1103;
    Git-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1074;.</p>

    <p>&#1054;&#1085; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; Git-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084;, &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081;
    Subversion-&#1082;&#1083;&#1080;&#1077;&#1085;&#1090;, TortoiseSVN, SvnKit &#1080; &#1087;&#1086;&#1076;&#1086;&#1073;&#1085;&#1099;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1088;&#1080;&#1081;.</p>
  </div>

  <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e23"></a>&#1050;&#1072;&#1082;&#1086;&#1074;&#1072; &#1094;&#1077;&#1083;&#1100; &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072;?</h2></div></div></div>
    

    <p>&#1055;&#1088;&#1086;&#1077;&#1082;&#1090; &#1089;&#1086;&#1079;&#1076;&#1072;&#1085; &#1076;&#1083;&#1103; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086;&#1073;&#1099; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1080;&#1090;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084; &#1080; &#1090;&#1077;&#1084; &#1078;&#1077;
    &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084; &#1082;&#1072;&#1082; &#1074; Git-&#1089;&#1090;&#1080;&#1083;&#1077;, &#1090;&#1072;&#1082; &#1080; &#1074; Subversion-&#1089;&#1090;&#1080;&#1083;&#1077;.</p>

    <div class="glosslist"><dl><dt><span class="glossterm">Git-&#1089;&#1090;&#1080;&#1083;&#1100;</span></dt><dd class="glossdef"><p>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1080;&#1076;&#1077;&#1103; &#1089;&#1074;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1082; &#1090;&#1086;&#1084;&#1091;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082; &#1087;&#1088;&#1086;&#1080;&#1079;&#1074;&#1086;&#1076;&#1080;&#1090; &#1074;&#1089;&#1077;
          &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1074; &#1083;&#1086;&#1082;&#1072;&#1083;&#1100;&#1085;&#1086;&#1081; &#1074;&#1077;&#1090;&#1082;&#1077;. &#1069;&#1090;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1085;&#1080;&#1082;&#1072;&#1082; &#1085;&#1077; &#1074;&#1083;&#1080;&#1103;&#1102;&#1090; &#1085;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091;
          &#1086;&#1089;&#1090;&#1072;&#1083;&#1100;&#1085;&#1099;&#1093; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1086;&#1074;, &#1085;&#1086; &#1090;&#1077;&#1084; &#1085;&#1077; &#1084;&#1077;&#1085;&#1077;&#1077; &#1080;&#1093; &#1084;&#1086;&#1078;&#1085;&#1086; &#1087;&#1088;&#1086;&#1090;&#1077;&#1089;&#1090;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1072;
          &#1089;&#1073;&#1086;&#1088;&#1086;&#1095;&#1085;&#1086;&#1081; &#1092;&#1077;&#1088;&#1084;&#1077;, &#1087;&#1077;&#1088;&#1077;&#1076;&#1072;&#1090;&#1100; &#1076;&#1088;&#1091;&#1075;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; &#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1091; &#1080;
          &#1090;.&#1076;.</p><p>&#1069;&#1090;&#1086; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1082;&#1072;&#1078;&#1076;&#1086;&#1084;&#1091; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; &#1074;&#1077;&#1089;&#1090;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1091; &#1085;&#1077;&#1079;&#1072;&#1074;&#1080;&#1089;&#1080;&#1084;&#1086;,
          &#1090;&#1072;&#1082;, &#1082;&#1072;&#1082; &#1077;&#1084;&#1091; &#1091;&#1076;&#1086;&#1073;&#1085;&#1086;, &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1103; &#1080; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1103; &#1087;&#1088;&#1086;&#1084;&#1077;&#1078;&#1091;&#1090;&#1086;&#1095;&#1085;&#1099;&#1077; &#1074;&#1077;&#1088;&#1089;&#1080;&#1080;
          &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074;, &#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1103;&#1089;&#1100; &#1074;&#1089;&#1077;&#1084;&#1080; &#1074;&#1086;&#1079;&#1084;&#1086;&#1078;&#1085;&#1086;&#1089;&#1090;&#1103;&#1084;&#1080; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; (&#1074; &#1090;&#1086;&#1084; &#1095;&#1080;&#1089;&#1083;&#1077;
          &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1086;&#1084; &#1082; &#1080;&#1089;&#1090;&#1086;&#1088;&#1080;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;) &#1076;&#1072;&#1078;&#1077; &#1074; &#1086;&#1090;&#1089;&#1091;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077; &#1089;&#1077;&#1090;&#1077;&#1074;&#1086;&#1075;&#1086; &#1089;&#1086;&#1077;&#1076;&#1080;&#1085;&#1077;&#1085;&#1080;&#1103;
          &#1089; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088;&#1086;&#1084;.</p><p>&#1050; &#1089;&#1086;&#1078;&#1072;&#1083;&#1077;&#1085;&#1080;&#1102;, &#1101;&#1090;&#1086;&#1090; &#1087;&#1086;&#1076;&#1093;&#1086;&#1076; &#1085;&#1077; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077;, &#1082;&#1086;&#1075;&#1076;&#1072;
          &#1080;&#1079;&#1084;&#1077;&#1085;&#1103;&#1077;&#1084;&#1099;&#1077; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1099; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090; &#1089;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077; (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1101;&#1090;&#1086;
          &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1086; &#1076;&#1083;&#1103; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;).</p></dd><dt><span class="glossterm">Subversion-&#1089;&#1090;&#1080;&#1083;&#1100;</span></dt><dd class="glossdef"><p>&#1048;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1094;&#1077;&#1085;&#1090;&#1088;&#1072;&#1083;&#1080;&#1079;&#1086;&#1074;&#1072;&#1085;&#1085;&#1086;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1073;&#1086;&#1083;&#1077;&#1077;
          &#1091;&#1076;&#1086;&#1073;&#1085;&#1086; &#1074; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1086;&#1074; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1097;&#1080;&#1093; &#1089;&#1083;&#1080;&#1103;&#1085;&#1080;&#1077;
          (&#1085;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;, &#1101;&#1090;&#1086; &#1093;&#1072;&#1088;&#1072;&#1082;&#1090;&#1077;&#1088;&#1085;&#1086; &#1076;&#1083;&#1103; &#1076;&#1074;&#1086;&#1080;&#1095;&#1085;&#1099;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074;) &#1079;&#1072; &#1089;&#1095;&#1077;&#1090; &#1085;&#1072;&#1083;&#1080;&#1095;&#1080;&#1103;
          &#1084;&#1077;&#1093;&#1072;&#1085;&#1080;&#1079;&#1084;&#1072; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1086;&#1082; &#1080; &#1073;&#1086;&#1083;&#1077;&#1077; &#1087;&#1088;&#1086;&#1089;&#1090;&#1086;&#1075;&#1086; &#1080; &#1082;&#1086;&#1088;&#1086;&#1090;&#1082;&#1086;&#1075;&#1086; &#1094;&#1080;&#1082;&#1083;&#1072; &#1087;&#1091;&#1073;&#1083;&#1080;&#1082;&#1072;&#1094;&#1080;&#1080;
          &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.</p></dd></dl></div>

    <p>&#1053;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1089;&#1086;&#1074;&#1084;&#1077;&#1089;&#1090;&#1080;&#1090;&#1100; Git-&#1089;&#1090;&#1080;&#1083;&#1100; &#1080; Subversion-&#1089;&#1090;&#1080;&#1083;&#1100; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1086;&#1076;&#1085;&#1080;&#1084;
    &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084; &#1074;&#1086;&#1079;&#1085;&#1080;&#1082;&#1072;&#1077;&#1090; &#1080;&#1079;-&#1079;&#1072; &#1090;&#1086;&#1075;&#1086;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1085;&#1099;&#1077; &#1089;&#1086;&#1090;&#1088;&#1091;&#1076;&#1085;&#1080;&#1082;&#1080; &#1074; &#1088;&#1072;&#1084;&#1082;&#1072;&#1093; &#1086;&#1076;&#1085;&#1086;&#1075;&#1086;
    &#1087;&#1088;&#1086;&#1077;&#1082;&#1090;&#1072; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090; &#1089; &#1087;&#1088;&#1080;&#1085;&#1094;&#1080;&#1087;&#1080;&#1072;&#1083;&#1100;&#1085;&#1086; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1084;&#1080;. &#1045;&#1089;&#1083;&#1080; &#1091;&#1090;&#1088;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100;, &#1090;&#1086;
    &#1087;&#1088;&#1086;&#1075;&#1088;&#1072;&#1084;&#1084;&#1080;&#1089;&#1090;&#1099; &#1087;&#1088;&#1077;&#1076;&#1087;&#1086;&#1095;&#1080;&#1090;&#1072;&#1102;&#1090; Git, &#1072; &#1093;&#1091;&#1076;&#1086;&#1078;&#1085;&#1080;&#1082;&#1080; &#1083;&#1102;&#1073;&#1103;&#1090; Subversion.</p>
  </div>

  <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e38"></a>&#1050;&#1072;&#1082; &#1086;&#1085;&#1086; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090;?</h2></div></div></div>
    

    <div class="mediaobject"><img src="images/git-as-svn.png"></div>

    <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e43"></a>&#1043;&#1076;&#1077; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; Subversion-&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;?</h3></div></div></div>
      

      <p>&#1044;&#1083;&#1103; &#1087;&#1088;&#1077;&#1076;&#1089;&#1090;&#1072;&#1074;&#1083;&#1077;&#1085;&#1080;&#1103; Subversion &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; &#1085;&#1091;&#1078;&#1085;&#1086; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1100; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102;
      &#1086; &#1090;&#1086;&#1084;, &#1082;&#1072;&#1082;&#1086;&#1081; &#1085;&#1086;&#1084;&#1077;&#1088; Subversion-&#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1080; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1091;&#1077;&#1090; &#1082;&#1072;&#1082;&#1086;&#1084;&#1091; Git-&#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1091;.
      &#1042;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1090;&#1100; &#1101;&#1090;&#1091; &#1080;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1102; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1088;&#1072;&#1079; &#1087;&#1088;&#1080; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;&#1077; &#1085;&#1077;&#1083;&#1100;&#1079;&#1103;, &#1090;&#1072;&#1082; &#1082;&#1072;&#1082; &#1090;&#1086;&#1075;&#1076;&#1072;
      &#1087;&#1077;&#1088;&#1074;&#1099;&#1081; &#1078;&#1077; <span class="command"><strong>git push --force</strong></span> &#1085;&#1072;&#1088;&#1091;&#1096;&#1080;&#1090; &#1087;&#1086;&#1088;&#1103;&#1076;&#1086;&#1082; &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1081;.
      &#1069;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1083;&#1077;&#1078;&#1072;&#1090; &#1074; &#1074;&#1077;&#1090;&#1082;&#1072;&#1093; <code class="filename">refs/git-as-svn/*</code>. &#1042;
      &#1095;&#1072;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1080; &#1080;&#1079;-&#1079;&#1072; &#1101;&#1090;&#1086;&#1075;&#1086; &#1085;&#1077; &#1090;&#1088;&#1077;&#1073;&#1091;&#1077;&#1090;&#1089;&#1103; &#1086;&#1090;&#1076;&#1077;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086; &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1086;&#1075;&#1086; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1076;&#1083;&#1103;
      Subversion-&#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</p>

      <p>&#1058;&#1072;&#1082;&#1078;&#1077; &#1095;&#1072;&#1089;&#1090;&#1100; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;, &#1085;&#1077;&#1086;&#1073;&#1093;&#1086;&#1076;&#1080;&#1084;&#1099;&#1093; &#1076;&#1083;&#1103; Subversion &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;, &#1086;&#1095;&#1077;&#1085;&#1100;
      &#1076;&#1086;&#1088;&#1086;&#1075;&#1086; &#1087;&#1086;&#1083;&#1091;&#1095;&#1080;&#1090;&#1100; &#1085;&#1072; &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; Git-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;.</p>

      <p>&#1053;&#1072;&#1087;&#1088;&#1080;&#1084;&#1077;&#1088;:</p>

      <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
          <p>&#1085;&#1086;&#1084;&#1077;&#1088; &#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1080; &#1089; &#1087;&#1088;&#1077;&#1076;&#1099;&#1076;&#1091;&#1097;&#1080;&#1084; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1077;&#1084; &#1092;&#1072;&#1081;&#1083;&#1072;;</p>
        </li><li class="listitem">
          <p>&#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086; &#1090;&#1086;&#1084;, &#1086;&#1090;&#1082;&#1091;&#1076;&#1072; &#1073;&#1099;&#1083; &#1089;&#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085; &#1092;&#1072;&#1081;&#1083;;</p>
        </li><li class="listitem">
          <p>MD5-&#1093;&#1101;&#1096; &#1092;&#1072;&#1081;&#1083;&#1072;.</p>
        </li></ul></div>

      <p>&#1063;&#1090;&#1086;&#1073;&#1099; &#1085;&#1077; &#1079;&#1072;&#1085;&#1080;&#1084;&#1072;&#1090;&#1100;&#1089;&#1103; &#1080;&#1093; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1077;&#1085;&#1080;&#1077;&#1084; &#1082;&#1072;&#1078;&#1076;&#1099;&#1081; &#1079;&#1072;&#1087;&#1091;&#1089;&#1082;, &#1101;&#1090;&#1080; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077;
      &#1082;&#1101;&#1096;&#1080;&#1088;&#1091;&#1102;&#1090;&#1089;&#1103; &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;&#1093;. &#1055;&#1086;&#1090;&#1077;&#1088;&#1103; &#1076;&#1072;&#1085;&#1085;&#1086;&#1075;&#1086; &#1082;&#1101;&#1096;&#1072; &#1085;&#1077; &#1082;&#1088;&#1080;&#1090;&#1080;&#1095;&#1085;&#1072; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1080; &#1077;&#1075;&#1086;
      &#1088;&#1077;&#1079;&#1077;&#1088;&#1074;&#1085;&#1086;&#1077; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1085;&#1077; &#1080;&#1084;&#1077;&#1077;&#1090; &#1089;&#1084;&#1099;&#1089;&#1083;&#1072;.</p>

      <p>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086; &#1073;&#1083;&#1086;&#1082;&#1080;&#1088;&#1086;&#1074;&#1082;&#1072;&#1093; &#1092;&#1072;&#1081;&#1083;&#1086;&#1074; &#1074; &#1076;&#1072;&#1085;&#1085;&#1099;&#1081; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1090;&#1072;&#1082;&#1078;&#1077; &#1093;&#1088;&#1072;&#1085;&#1103;&#1090;&#1089;&#1103; &#1074; &#1092;&#1072;&#1081;&#1083;&#1072;
      &#1082;&#1101;&#1096;&#1072;.</p>
    </div>

    <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e59"></a>&#1050;&#1072;&#1082; &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1077;&#1090; &#1082;&#1086;&#1084;&#1084;&#1080;&#1090;?</h3></div></div></div>
      

      <p>&#1054;&#1076;&#1085;&#1072; &#1080;&#1079; &#1089;&#1072;&#1084;&#1099;&#1093; &#1074;&#1072;&#1078;&#1085;&#1099;&#1093; &#1076;&#1077;&#1090;&#1072;&#1083;&#1077;&#1081; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1099; &#8212; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1077;&#1085;&#1080;&#1077;
      &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081;.</p>

      <p>&#1042; &#1086;&#1073;&#1097;&#1080;&#1093; &#1095;&#1077;&#1088;&#1090;&#1072;&#1093;, &#1072;&#1083;&#1075;&#1086;&#1088;&#1080;&#1090;&#1084; &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1081;:</p>

      <div class="orderedlist"><ol class="orderedlist" type="1"><li class="listitem">
          <p>&#1042; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1099; <span class="command"><strong>svn commit</strong></span> &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;
          &#1086;&#1090;&#1087;&#1088;&#1072;&#1074;&#1083;&#1103;&#1077;&#1090; &#1085;&#1072; &#1089;&#1077;&#1088;&#1074;&#1077;&#1088; &#1089;&#1074;&#1086;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103;. &#1057;&#1077;&#1088;&#1074;&#1077;&#1088; &#1079;&#1072;&#1087;&#1086;&#1084;&#1080;&#1085;&#1072;&#1077;&#1090; &#1080;&#1093;. &#1042; &#1101;&#1090;&#1086;&#1090; &#1078;&#1077;
          &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1087;&#1077;&#1088;&#1074;&#1072;&#1103; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1089;&#1082;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093; &#1085;&#1072;
          &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100;.</p>
        </li><li class="listitem">
          <p>&#1057;&#1077;&#1088;&#1074;&#1077;&#1088; &#1073;&#1077;&#1088;&#1077;&#1090; &#1075;&#1086;&#1083;&#1086;&#1074;&#1091; &#1074;&#1077;&#1090;&#1082;&#1080; &#1080; &#1085;&#1072;&#1095;&#1080;&#1085;&#1072;&#1077;&#1090; &#1092;&#1086;&#1088;&#1084;&#1080;&#1088;&#1086;&#1074;&#1072;&#1090;&#1100; &#1085;&#1086;&#1074;&#1099;&#1081; &#1082;&#1086;&#1084;&#1084;&#1080;&#1090;
          &#1085;&#1072; &#1073;&#1072;&#1079;&#1077; &#1087;&#1086;&#1083;&#1091;&#1095;&#1077;&#1085;&#1085;&#1099;&#1093; &#1086;&#1090; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1072; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;. &#1042; &#1101;&#1090;&#1086;&#1090; &#1084;&#1086;&#1084;&#1077;&#1085;&#1090; &#1087;&#1088;&#1086;&#1080;&#1089;&#1093;&#1086;&#1076;&#1080;&#1090; &#1077;&#1097;&#1105;
          &#1086;&#1076;&#1085;&#1072; &#1087;&#1088;&#1086;&#1074;&#1077;&#1088;&#1082;&#1072; &#1085;&#1072; &#1072;&#1082;&#1090;&#1091;&#1072;&#1083;&#1100;&#1085;&#1086;&#1089;&#1090;&#1100; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1089;&#1082;&#1080;&#1093; &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</p>
        </li><li class="listitem">
          <p>&#1055;&#1088;&#1086;&#1074;&#1077;&#1088;&#1103;&#1077;&#1090;&#1089;&#1103; &#1094;&#1077;&#1083;&#1086;&#1089;&#1090;&#1085;&#1086;&#1089;&#1090;&#1100; svn properties &#1076;&#1083;&#1103; &#1079;&#1072;&#1083;&#1080;&#1074;&#1072;&#1077;&#1084;&#1099;&#1093;
          &#1076;&#1072;&#1085;&#1085;&#1099;&#1093;.</p>
        </li><li class="listitem">
          <p>&#1057;&#1077;&#1088;&#1074;&#1077;&#1088; &#1087;&#1099;&#1090;&#1072;&#1077;&#1090;&#1089;&#1103; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1099;&#1084; Git-&#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1086;&#1084; &#1089;&#1076;&#1077;&#1083;&#1072;&#1090;&#1100; push &#1085;&#1086;&#1074;&#1086;&#1075;&#1086;
          &#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1072; &#1074; &#1090;&#1077;&#1082;&#1091;&#1097;&#1091;&#1102; &#1074;&#1077;&#1090;&#1082;&#1091; &#1101;&#1090;&#1086;&#1075;&#1086; &#1078;&#1077; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;. &#1044;&#1072;&#1083;&#1077;&#1077; &#1087;&#1086; &#1088;&#1077;&#1079;&#1091;&#1083;&#1100;&#1090;&#1072;&#1090;&#1091;
          push-&#1072;:</p>

          <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
              <p>&#1077;&#1089;&#1083;&#1080; &#1074;&#1089;&#1077; &#1093;&#1086;&#1088;&#1086;&#1096;&#1086; &#8212; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;
              git-&#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1086;&#1074; &#1080; &#1088;&#1072;&#1076;&#1091;&#1077;&#1084;&#1089;&#1103;;</p>
            </li><li class="listitem">
              <p>&#1077;&#1089;&#1083;&#1080; &#1085;&#1077; fast forward &#8212; &#1079;&#1072;&#1075;&#1088;&#1091;&#1078;&#1072;&#1077;&#1084; &#1087;&#1086;&#1089;&#1083;&#1077;&#1076;&#1085;&#1080;&#1077; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1103; &#1080;&#1079;
              git-&#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1086;&#1074; &#1080; &#1080;&#1076;&#1105;&#1084; &#1082; &#1096;&#1072;&#1075;&#1091; 2;</p>
            </li><li class="listitem">
              <p>&#1077;&#1089;&#1083;&#1080; &#1086;&#1090;&#1073;&#1080;&#1083;&#1080; &#1093;&#1091;&#1082;&#1080; &#8212; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1084; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1091;;</p>
            </li><li class="listitem">
              <p>&#1077;&#1089;&#1083;&#1080; &#1076;&#1088;&#1091;&#1075;&#1072;&#1103; &#1086;&#1096;&#1080;&#1073;&#1082;&#1072; &#8212; &#1089;&#1086;&#1086;&#1073;&#1097;&#1072;&#1077;&#1084; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1091;.</p>
            </li></ul></div>
        </li></ol></div>

      <p>&#1058;&#1072;&#1082;&#1080;&#1084; &#1086;&#1073;&#1088;&#1072;&#1079;&#1086;&#1084;, &#1079;&#1072; &#1089;&#1095;&#1105;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1082;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1086;&#1075;&#1086;
      Git-&#1072;, &#1084;&#1099; &#1080;&#1079;&#1073;&#1077;&#1075;&#1072;&#1077;&#1090; &#1075;&#1086;&#1085;&#1082;&#1080; &#1089; &#1079;&#1072;&#1083;&#1080;&#1074;&#1082;&#1086;&#1081; &#1085;&#1072;&#1087;&#1088;&#1103;&#1084;&#1091;&#1102; &#1095;&#1077;&#1088;&#1077;&#1079; Git &#1080; &#1087;&#1086;&#1083;&#1091;&#1095;&#1072;&#1077;&#1084; &#1093;&#1091;&#1082;&#1080; &#1074;
      &#1082;&#1072;&#1095;&#1077;&#1089;&#1090;&#1074;&#1077; &#1087;&#1088;&#1080;&#1103;&#1090;&#1085;&#1086;&#1075;&#1086; &#1073;&#1086;&#1085;&#1091;&#1089;&#1072;.</p>
    </div>

    <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e83"></a>&#1054;&#1090;&#1083;&#1080;&#1095;&#1080;&#1077; &#1086;&#1090; &#1076;&#1088;&#1091;&#1075;&#1080;&#1093; &#1088;&#1077;&#1096;&#1077;&#1085;&#1080;&#1081;</h3></div></div></div>
      

      <p>&#1055;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1091; &#1089;&#1086;&#1074;&#1084;&#1077;&#1097;&#1077;&#1085;&#1080;&#1103; Git &#1080; Subversion &#1089;&#1090;&#1080;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089; &#1089;&#1080;&#1089;&#1090;&#1077;&#1084;&#1086;&#1081;
      &#1082;&#1086;&#1085;&#1090;&#1088;&#1086;&#1083;&#1103; &#1074;&#1077;&#1088;&#1089;&#1080;&#1081; &#1084;&#1086;&#1078;&#1085;&#1086; &#1088;&#1077;&#1096;&#1080;&#1090;&#1100; &#1088;&#1072;&#1079;&#1085;&#1099;&#1084;&#1080; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073;&#1072;&#1084;&#1080;.</p>

      <div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e86"></a>&#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1082;&#1072; Subversion &#1091; GitHub</h4></div></div></div>
        

        <div class="mediaobject"><img src="images/github.png"></div>

        <p>&#1069;&#1090;&#1086;, &#1085;&#1072;&#1074;&#1077;&#1088;&#1085;&#1086;&#1077;, &#1089;&#1072;&#1084;&#1099;&#1081; &#1073;&#1083;&#1080;&#1079;&#1082;&#1080;&#1081; &#1072;&#1085;&#1072;&#1083;&#1086;&#1075;.</p>

        <p>&#1054;&#1089;&#1085;&#1086;&#1074;&#1085;&#1072;&#1103; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1072; &#1076;&#1072;&#1085;&#1085;&#1086;&#1081; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1080; &#8212; &#1085;&#1077;&#1086;&#1090;&#1076;&#1077;&#1083;&#1080;&#1084;&#1086;&#1089;&#1090;&#1100; &#1086;&#1090; GitHub.
        &#1058;&#1072;&#1082;&#1078;&#1077;, &#1074;&#1085;&#1077;&#1079;&#1072;&#1087;&#1085;&#1086;, &#1076;&#1072;&#1085;&#1085;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1085;&#1077; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090; Git LFS.</p>

        <p>&#1042; &#1089;&#1083;&#1091;&#1095;&#1072;&#1077; &#1089; GitHub &#1090;&#1072;&#1082;&#1078;&#1077; &#1085;&#1077; &#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;, &#1075;&#1076;&#1077; &#1093;&#1088;&#1072;&#1085;&#1080;&#1090;&#1089;&#1103; &#1089;&#1086;&#1086;&#1090;&#1074;&#1077;&#1090;&#1089;&#1090;&#1074;&#1080;&#1077;
        &#1084;&#1077;&#1078;&#1076;&#1091; Subversion-&#1088;&#1077;&#1074;&#1080;&#1079;&#1080;&#1103;&#1084;&#1080; &#1080; Git-&#1082;&#1086;&#1084;&#1084;&#1080;&#1090;&#1072;&#1084;&#1080;. &#1069;&#1090;&#1086; &#1084;&#1086;&#1078;&#1077;&#1090; &#1073;&#1099;&#1090;&#1100; &#1087;&#1088;&#1086;&#1073;&#1083;&#1077;&#1084;&#1086;&#1081;
        &#1087;&#1088;&#1080; &#1074;&#1086;&#1089;&#1089;&#1090;&#1072;&#1085;&#1086;&#1074;&#1083;&#1077;&#1085;&#1080;&#1080; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1074; &#1087;&#1086;&#1089;&#1083;&#1077; &#1074;&#1085;&#1077;&#1096;&#1090;&#1072;&#1090;&#1085;&#1099;&#1093; &#1089;&#1080;&#1090;&#1091;&#1072;&#1094;&#1080;&#1081;.</p>
      </div>

      <div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e94"></a>SubGit</h4></div></div></div>
        

        <div class="mediaobject"><img src="images/subgit.png"></div>

        <p>&#1057;&#1072;&#1081;&#1090;: <a class="ulink" href="http://www.subgit.com/" target="_top">http://www.subgit.com/</a></p>

        <p>&#1044;&#1086;&#1089;&#1090;&#1072;&#1090;&#1086;&#1095;&#1085;&#1086; &#1080;&#1085;&#1090;&#1077;&#1088;&#1077;&#1089;&#1085;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1088;&#1080; &#1082;&#1086;&#1090;&#1086;&#1088;&#1086;&#1081; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; Git
        &#1080; Subversion-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1074; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;&#1084; &#1089;&#1086;&#1089;&#1090;&#1086;&#1103;&#1085;&#1080;&#1080;. &#1047;&#1072; &#1089;&#1095;&#1077;&#1090; &#1095;&#1077;&#1075;&#1086;
        &#1086;&#1073;&#1077;&#1089;&#1087;&#1077;&#1095;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; &#1089;&#1080;&#1085;&#1093;&#1088;&#1086;&#1085;&#1085;&#1086;&#1089;&#1090;&#1100; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1074; &#8212; &#1085;&#1077;&#1087;&#1086;&#1085;&#1103;&#1090;&#1085;&#1086;.</p>
      </div>

      <div class="section"><div class="titlepage"><div><div><h4 class="title"><a name="d5e102"></a>Subversion &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081; &#1080; git svn</h4></div></div></div>
        

        <div class="mediaobject"><img src="images/git-svn.png"></div>

        <p>&#1044;&#1072;&#1085;&#1085;&#1099;&#1081; &#1089;&#1087;&#1086;&#1089;&#1086;&#1073; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; Git &#1087;&#1088;&#1080; &#1088;&#1072;&#1073;&#1086;&#1090;&#1077; &#1089;
        Subversion-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084;, &#1085;&#1086; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1085;&#1080;&#1077; &#1086;&#1073;&#1097;&#1077;&#1075;&#1086; Git-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103; &#1084;&#1077;&#1078;&#1076;&#1091;
        &#1085;&#1077;&#1089;&#1082;&#1086;&#1083;&#1100;&#1082;&#1080;&#1084;&#1080; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1072;&#1084;&#1080; &#1089;&#1080;&#1083;&#1100;&#1085;&#1086; &#1079;&#1072;&#1090;&#1088;&#1091;&#1076;&#1085;&#1077;&#1085;&#1086;.</p>

        <p>&#1058;&#1072;&#1082;&#1078;&#1077; &#1085;&#1072;&#1076;&#1086; &#1091;&#1095;&#1077;&#1089;&#1090;&#1100;, &#1095;&#1090;&#1086; &#1088;&#1072;&#1079;&#1088;&#1072;&#1073;&#1086;&#1090;&#1095;&#1080;&#1082;&#1091; &#1087;&#1088;&#1080;&#1093;&#1086;&#1076;&#1080;&#1090;&#1089;&#1103; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100;
        &#1089;&#1087;&#1077;&#1094;&#1080;&#1092;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1081; &#1080;&#1085;&#1089;&#1090;&#1088;&#1091;&#1084;&#1077;&#1085;&#1090; &#1082;&#1086;&#1084;&#1072;&#1085;&#1076;&#1085;&#1086;&#1081; &#1089;&#1090;&#1088;&#1086;&#1082;&#1080; &#1076;&#1083;&#1103; &#1088;&#1072;&#1073;&#1086;&#1090;&#1099; &#1089;
        &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1077;&#1084;.</p>
      </div>
    </div>
  </div>

  <div class="section"><div class="titlepage"><div><div><h2 class="title" style="clear: both"><a name="d5e109"></a>&#1060;&#1091;&#1085;&#1082;&#1094;&#1080;&#1086;&#1085;&#1072;&#1083;</h2></div></div></div>
    

    <p>&#1044;&#1072;&#1085;&#1085;&#1072;&#1103; &#1088;&#1077;&#1072;&#1083;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1087;&#1086;&#1079;&#1074;&#1086;&#1083;&#1103;&#1077;&#1090; &#1073;&#1086;&#1083;&#1100;&#1096;&#1080;&#1085;&#1089;&#1090;&#1074;&#1091; Subversion-&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1077;&#1083;&#1077;&#1081;
    &#1088;&#1072;&#1073;&#1086;&#1090;&#1072;&#1090;&#1100; &#1085;&#1077; &#1079;&#1072;&#1076;&#1091;&#1084;&#1099;&#1074;&#1072;&#1103;&#1089;&#1100; &#1086; &#1090;&#1086;&#1084;, &#1095;&#1090;&#1086; &#1086;&#1085;&#1080; &#1085;&#1072; &#1089;&#1072;&#1084;&#1086;&#1084; &#1076;&#1077;&#1083;&#1077; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1091;&#1102;&#1090;
    Git-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1081;.</p>

    <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e112"></a>&#1063;&#1090;&#1086; &#1091;&#1078;&#1077; &#1077;&#1089;&#1090;&#1100;?</h3></div></div></div>
      

      <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
          <p>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;, &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1082;&#1083;&#1080;&#1077;&#1085;&#1090;&#1099;:</p>

          <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: circle; "><li class="listitem">
              <p>&#1050;&#1086;&#1085;&#1089;&#1086;&#1083;&#1100;&#1085;&#1099;&#1081; Subversion-&#1082;&#1083;&#1080;&#1077;&#1085;&#1090;;</p>
            </li><li class="listitem">
              <p>TortoiseSVN;</p>
            </li><li class="listitem">
              <p>SvnKit.</p>
            </li></ul></div>
        </li><li class="listitem">
          <p>&#1056;&#1072;&#1073;&#1086;&#1090;&#1072;&#1102;&#1090;, &#1082;&#1072;&#1082; &#1084;&#1080;&#1085;&#1080;&#1084;&#1091;&#1084;, &#1089;&#1083;&#1077;&#1076;&#1091;&#1102;&#1097;&#1080;&#1077; &#1086;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080;:</p>

          <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: circle; "><li class="listitem">
              <p>svn checkout, update, switch, diff</p>
            </li><li class="listitem">
              <p>svn commit</p>
            </li><li class="listitem">
              <p>svn copy, move<a href="#ftn.d5e133" class="footnote" name="d5e133"><sup class="footnote">[1]</sup></a></p>
            </li><li class="listitem">
              <p>svn cat, ls</p>
            </li><li class="listitem">
              <p>svn lock, unlock</p>
            </li><li class="listitem">
              <p>svn replay (svnsync)</p>
            </li></ul></div>
        </li><li class="listitem">
          <p>&#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1077;&#1090;&#1089;&#1103; Git LFS;</p>
        </li><li class="listitem">
          <p>&#1055;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103; git submodules;<a href="#ftn.d5e146" class="footnote" name="d5e146"><sup class="footnote">[2]</sup></a></p>
        </li><li class="listitem">
          <p>&#1040;&#1074;&#1090;&#1086;&#1088;&#1080;&#1079;&#1072;&#1094;&#1080;&#1103; &#1095;&#1077;&#1088;&#1077;&#1079; LDAP;</p>
        </li><li class="listitem">
          <p>&#1048;&#1085;&#1090;&#1077;&#1075;&#1088;&#1072;&#1094;&#1080;&#1103; &#1089; GitLab.</p>
        </li></ul></div>
    </div>

    <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e152"></a>&#1063;&#1077;&#1075;&#1086; &#1077;&#1097;&#1077; &#1085;&#1077;&#1090;?</h3></div></div></div>
      

      <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
          <p>&#1041;&#1086;&#1083;&#1100;&#1096;&#1080;&#1077; &#1087;&#1088;&#1086;&#1073;&#1077;&#1083;&#1099; &#1074; &#1076;&#1086;&#1082;&#1091;&#1084;&#1077;&#1085;&#1090;&#1072;&#1094;&#1080;&#1080;;</p>
        </li><li class="listitem">
          <p>&#1048;&#1079; Subversion &#1076;&#1086;&#1089;&#1090;&#1091;&#1087;&#1085;&#1072; &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1086;&#1076;&#1085;&#1072; &#1074;&#1077;&#1090;&#1082;&#1072;.</p>
        </li></ul></div>
    </div>

    <div class="section"><div class="titlepage"><div><div><h3 class="title"><a name="d5e159"></a>&#1058;&#1077;&#1093;&#1085;&#1080;&#1095;&#1077;&#1089;&#1082;&#1080;&#1077; &#1086;&#1075;&#1088;&#1072;&#1085;&#1080;&#1095;&#1077;&#1085;&#1080;&#1103;</h3></div></div></div>
      

      <div class="itemizedlist"><ul class="itemizedlist" style="list-style-type: disc; "><li class="listitem">
          <p>&#1053;&#1077;&#1083;&#1100;&#1079;&#1103; &#1089;&#1088;&#1077;&#1076;&#1089;&#1090;&#1074;&#1072;&#1084;&#1080; Subversion &#1084;&#1077;&#1085;&#1103;&#1090;&#1100; svn properties;</p>
        </li><li class="listitem">
          <p>&#1053;&#1077;&#1083;&#1100;&#1079;&#1103; &#1089;&#1086;&#1079;&#1076;&#1072;&#1074;&#1072;&#1090;&#1100; &#1087;&#1091;&#1089;&#1090;&#1099;&#1077; &#1076;&#1080;&#1088;&#1077;&#1082;&#1090;&#1086;&#1088;&#1080;&#1080;.</p>
        </li></ul></div>
    </div>
  </div>
<div class="footnotes"><br><hr style="width:100; text-align:left;margin-left: 0"><div id="ftn.d5e133" class="footnote">
                  <p><a href="#d5e133" class="para"><sup class="para">[1] </sup></a>&#1054;&#1087;&#1077;&#1088;&#1072;&#1094;&#1080;&#1080; &#1087;&#1086;&#1076;&#1076;&#1077;&#1088;&#1078;&#1080;&#1074;&#1072;&#1102;&#1090;&#1089;&#1103;, &#1085;&#1086; &#1076;&#1072;&#1085;&#1085;&#1099;&#1077; &#1086;&#1073; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1077;
                  &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1085;&#1077; &#1089;&#1086;&#1093;&#1088;&#1072;&#1085;&#1103;&#1102;&#1090;&#1089;&#1103;.</p>

                  <p>&#1048;&#1085;&#1092;&#1086;&#1088;&#1084;&#1072;&#1094;&#1080;&#1103; &#1086;&#1073; &#1080;&#1089;&#1090;&#1086;&#1095;&#1085;&#1080;&#1082;&#1077; &#1082;&#1086;&#1087;&#1080;&#1088;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103; &#1074;&#1099;&#1095;&#1080;&#1089;&#1083;&#1103;&#1077;&#1090;&#1089;&#1103; &#1085;&#1072;
                  &#1086;&#1089;&#1085;&#1086;&#1074;&#1072;&#1085;&#1080;&#1080; &#1080;&#1079;&#1084;&#1077;&#1085;&#1077;&#1085;&#1080;&#1081; Git-&#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1103;.</p>
                </div><div id="ftn.d5e146" class="footnote">
              <p><a href="#d5e146" class="para"><sup class="para">[2] </sup></a>&#1044;&#1072;&#1085;&#1085;&#1099;&#1077; &#1080;&#1079; git submodule &#1074;&#1080;&#1076;&#1085;&#1099; &#1074; &#1088;&#1077;&#1087;&#1086;&#1079;&#1080;&#1090;&#1086;&#1088;&#1080;&#1080; &#1074; &#1088;&#1077;&#1078;&#1080;&#1084;&#1077;
              &#1090;&#1086;&#1083;&#1100;&#1082;&#1086; &#1076;&#1083;&#1103; &#1095;&#1090;&#1077;&#1085;&#1080;&#1103;.</p>
            </div></div></div><div class="navfooter"><hr><table width="100%" summary="Navigation footer"><tr><td width="40%" align="left"><a accesskey="p" href="index.html">&#1055;&#1088;&#1077;&#1076;.</a>&nbsp;</td><td width="20%" align="center">&nbsp;</td><td width="40%" align="right">&nbsp;<a accesskey="n" href="ch02.html">&#1057;&#1083;&#1077;&#1076;.</a></td></tr><tr><td width="40%" align="left" valign="top">Git as Subversion&nbsp;</td><td width="20%" align="center"><a accesskey="h" href="index.html">&#1053;&#1072;&#1095;&#1072;&#1083;&#1086;</a></td><td width="40%" align="right" valign="top">&nbsp;&#1043;&#1083;&#1072;&#1074;&#1072; 2. &#1055;&#1088;&#1077;&#1076;&#1074;&#1072;&#1088;&#1080;&#1090;&#1077;&#1083;&#1100;&#1085;&#1099;&#1077; &#1090;&#1088;&#1077;&#1073;&#1086;&#1074;&#1072;&#1085;&#1080;&#1103;</td></tr></table></div></body></html>